garyPenhook/PyAvrOCD/svd/avr32dd14.svd
        <register>
          <name>SEQCTRL0</name>
          <description>Sequential Control 0</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQSEL</name>
              <description>Sequential Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Sequential logic disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFF</name>
                  <description>D FlipFlop</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JK</name>
                  <description>JK FlipFlop</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATCH</name>
                  <description>D Latch</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS</name>
                  <description>RS Latch</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL1</name>
          <description>Sequential Control 1</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQSEL</name>
              <description>Sequential Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Sequential logic disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFF</name>
                  <description>D FlipFlop</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JK</name>
                  <description>JK FlipFlop</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATCH</name>
                  <description>D Latch</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS</name>
                  <description>RS Latch</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH0</name>
          <description>Truth 0</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH1</name>
          <description>Truth 1</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH2</name>
          <description>Truth 2</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH3</name>
          <description>Truth 3</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
